# 데이터분석과 시각화

## *인공지능융합학부* ` 20226744학번 ` **박제현**

### 10월 5일 수업 강의 내용"

In [1]:
sub_list = ['math', 'english', 'science', 'history']
score_list = [87, 94, 85, 92]
Fscore_list = [i + 4 for i in score_list]
sem_dic = {'subject': sub_list, 'M_scr': score_list, 'F_scr' : Fscore_list}

In [2]:
import pandas  as pd

ds = pd.Series(Fscore_list)
ds

0    91
1    98
2    89
3    96
dtype: int64

In [3]:
ds.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
df1 = pd.DataFrame(sem_dic)
df1

   subject  M_scr  F_scr
0     math     87     91
1  english     94     98
2  science     85     89
3  history     92     96

In [5]:
df1['M_scr']

0    87
1    94
2    85
3    92
Name: M_scr, dtype: int64

In [6]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
df1.values

array([['math', 87, 91],
       ['english', 94, 98],
       ['science', 85, 89],
       ['history', 92, 96]], dtype=object)

In [8]:
df1.columns

Index(['subject', 'M_scr', 'F_scr'], dtype='object')

In [9]:
df2 = pd.DataFrame([score_list, Fscore_list], index = ['M_scr', 'F_scr'], columns = sub_list)
df2

       math  english  science  history
M_scr    87       94       85       92
F_scr    91       98       89       96

In [10]:
df1.mean()

C:\Users\AI_Workspace\AppData\Local\Temp\ipykernel_25320\2053335143.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.mean()

M_scr    89.5
F_scr    93.5
dtype: float64

In [11]:
# for i in range(len(df1.index)):
#     r_sum = 0
#     for j in range(1, len(df1.columns)):
#         r_sum += df1[df1.columns[j]][i]
#     print(df1[df1.columns[0]][i], r_sum)


for i in range(len(df1.values)):
    r_sum = 0
    for j in df1.values[i]:
        if type(j) == str:
            print(j, end = ' ')
        elif type(j) == int:
            r_sum += j
    print(r_sum)

math 178
english 192
science 174
history 188

In [12]:
df1.set_index('subject', inplace = True) # df1 = df1.set_index('subject')
df1

         M_scr  F_scr
subject
math        87     91
english     94     98
science     85     89
history     92     96

In [13]:
for i in df1.index:
    r_sum = 0
    for j in df1.columns:
        r_sum += df1[j][i]
    print(i, r_sum)

math 178
english 192
science 174
history 188

In [14]:
df1['sum'] = df1['M_scr'] + df1['F_scr']
df1

         M_scr  F_scr  sum
subject
math        87     91  178
english     94     98  192
science     85     89  174
history     92     96  188

In [15]:
df1['mean'] = df1['sum'] / 2
df1

         M_scr  F_scr  sum  mean
subject
math        87     91  178  89.0
english     94     98  192  96.0
science     85     89  174  87.0
history     92     96  188  94.0

In [16]:
del df1['sum']
del df1['mean']
df1

         M_scr  F_scr
subject
math        87     91
english     94     98
science     85     89
history     92     96

In [17]:
df1 = df1.assign(sums = df1['M_scr'] + df1['F_scr'])
df1 = df1.assign(means = df1['sums'] / 2)
df1

         M_scr  F_scr  sums  means
subject
math        87     91   178   89.0
english     94     98   192   96.0
science     85     89   174   87.0
history     92     96   188   94.0

In [18]:
df1.reset_index(inplace = True)
df1

   subject  M_scr  F_scr  sums  means
0     math     87     91   178   89.0
1  english     94     98   192   96.0
2  science     85     89   174   87.0
3  history     92     96   188   94.0

In [19]:
df1.set_index('subject', inplace = True)
df1

         M_scr  F_scr  sums  means
subject
math        87     91   178   89.0
english     94     98   192   96.0
science     85     89   174   87.0
history     92     96   188   94.0

In [20]:
df1.sum()

M_scr    358.0
F_scr    374.0
sums     732.0
means    366.0
dtype: float64

In [21]:
#행 방향 입력
df1.loc['total'] = df1.sum()
df1

         M_scr  F_scr   sums  means
subject
math      87.0   91.0  178.0   89.0
english   94.0   98.0  192.0   96.0
science   85.0   89.0  174.0   87.0
history   92.0   96.0  188.0   94.0
total    358.0  374.0  732.0  366.0

In [22]:
df1.loc['average'] = df1[0:4].mean()
df1

         M_scr  F_scr   sums  means
subject
math      87.0   91.0  178.0   89.0
english   94.0   98.0  192.0   96.0
science   85.0   89.0  174.0   87.0
history   92.0   96.0  188.0   94.0
total    358.0  374.0  732.0  366.0
average   89.5   93.5  183.0   91.5

In [23]:
df1.columns = ['중간', '기말', '총점', '평균']
df1.index = ['수학', '영어', '과학', '역사', '총점', '평균']
df1

       중간     기말     총점     평균
수학   87.0   91.0  178.0   89.0
영어   94.0   98.0  192.0   96.0
과학   85.0   89.0  174.0   87.0
역사   92.0   96.0  188.0   94.0
총점  358.0  374.0  732.0  366.0
평균   89.5   93.5  183.0   91.5

In [24]:
df1.rename(index = {'math': '수학', 'english': '영어', 'science': '과학', 'history': '역사', 'sums': '총점', 'total': '총점', 'means': '평균', 'average': '평균'}, inplace = True)
df1

       중간     기말     총점     평균
수학   87.0   91.0  178.0   89.0
영어   94.0   98.0  192.0   96.0
과학   85.0   89.0  174.0   87.0
역사   92.0   96.0  188.0   94.0
총점  358.0  374.0  732.0  366.0
평균   89.5   93.5  183.0   91.5

In [25]:
import copy

df3 = copy.deepcopy(df1)
df3.rename(columns = {'중간': 1, '기말': 2, '총점': 3, '평균': 4}, inplace = True)
df3

        1      2      3      4
수학   87.0   91.0  178.0   89.0
영어   94.0   98.0  192.0   96.0
과학   85.0   89.0  174.0   87.0
역사   92.0   96.0  188.0   94.0
총점  358.0  374.0  732.0  366.0
평균   89.5   93.5  183.0   91.5

In [26]:
df3.drop(index = '총점', inplace = True)
df3

       1     2      3     4
수학  87.0  91.0  178.0  89.0
영어  94.0  98.0  192.0  96.0
과학  85.0  89.0  174.0  87.0
역사  92.0  96.0  188.0  94.0
평균  89.5  93.5  183.0  91.5

In [27]:
df3.drop(columns = 4, inplace = True)
df3

       1     2      3
수학  87.0  91.0  178.0
영어  94.0  98.0  192.0
과학  85.0  89.0  174.0
역사  92.0  96.0  188.0
평균  89.5  93.5  183.0